Table of Contents
 Interface IGrpcMessageHandler
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Non generic implementation of IGrpcMessageHandler<T>
public interface IGrpcMessageHandler
Methods
 HandleClientMessage(GrpcMessage, IGrpcSender)
Handles response incoming from the server.
Task<object> HandleClientMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
grpcSender IGrpcSender
Returns
Task<object>
 HandleServerMessage(GrpcMessage, IGrpcSender)
Handles request incoming from the client.
Task<object> HandleServerMessage(GrpcMessage message, IGrpcSender grpcSender)
Parameters
message GrpcMessage
grpcSender IGrpcSender
Returns
Task<object>
 Edit this page